// --------------------------------------------------------------------------------------------
// Логическое И (операнд &&) - преобразовывает к булю, ищет false
// - запинается на лжи
// - возвращает то, на чем запнулось или последний операнд
// console.log(5 && 0 && 7 && 'hello');

// --------------------------------------------------------------------------------------------
// Логическое ИЛИ (операнд ||) ищет true
// - запинается на правде
// - возвращает то, на чем запнулось или последний операнд

// console.log(false || 6 || 7 || 'hello');

// --------------------------------------------------------------------------------------------
// Логическое НЕ (оператор !)
// Делает инверсию правда > ложь и ложь > правда

// console.log(!0); // будет true

// --------------------------------------------------------------------------------------------
// ОПЕРАТОР ВЕТВЛЕНИЯ if...else

// const x = 5;
// const y = 7;
// if (x > y) {
//   console.log('x > y');
// } else {
//   console.log('x < y');
// }
